using System;
using System.Collections.Generic;
using System.Text;

namespace ArooshaPOS
{
    public class Shahr
    {
        private string[,] ResponceMessage = new string[66, 2]
        {
      {
        "00",
        "تراکنش به درستي انجام شده است."
      },
      {
        "02",
        "تراکنش قبلاً REVERSE شده است(در پاسخ به REVERSE) "
      },
      {
        "03",
        "پذيرنده کارت شناخته شده نيست.بايد عمل بازکردن فروشگاه را انجام دهيد. "
      },
      {
        "06",
        "اشکال در سيستم مرکز "
      },
      {
        "12",
        "پيام نادرست است.يکي از دلايل اين خطا عدم مجوز پايانه در انجام عمليات مورد نظر مي باشد. "
      },
      {
        "13",
        "مقدار ريالي غلط است.(مبلغ تراکنش صحيح نيست) "
      },
      {
        "14",
        "شماره کارت شناخته شده نيست.(کارت در سيستم خدمات کارت نامعتبر است)"
      },
      {
        "15",
        "در پاسخ به تراکنش باز کردن فروشگاه :قبلاً باز شده است"
      },
      {
        "16",
        "در پاسخ به تراکنش بستن فروشگاه :قبلاً بسته شده است."
      },
      {
        "19",
        "در پاسخ به تراکنش تراز تجاري پايانه:مجموع تراکنشهاي پايانه با مجموع تراکنشهاي مرکز برابر نيست."
      },
      {
        "20",
        "پاسخ دريافت شده از ATM ناشناخته است."
      },
      {
        "21",
        "هيچ عملي بر روي تراکنش انجام نشد."
      },
      {
        "22",
        "خطاي سخت افزاري در ATM "
      },
      {
        "24",
        "در پاسخ به تراکنش پايان روز: عمليات انجام نشد. بايد تراکنش دوباره تکرار گردد."
      },
      {
        "25",
        "داده ارسالي غلط است واين داده در مرکز پيدا نشد.(ممکن است شماره پايانه باشد)"
      },
      {
        "29",
        "در پاسخ به تراکنش پايان روز انجام نشده. لازم است پيگيري شود."
      },
      {
        "30",
        "فرمت اشتباه است."
      },
      {
        "33",
        "تاريخ انقضاي کارت سپري شده است."
      },
      {
        "34",
        "تراکنش مالي تاييد نشده است(در پاسخ به REVERSE) "
      },
      {
        "37",
        "کارت مقصد در تراکنش انتقال مشکل دارد."
      },
      {
        "39",
        "حساب اعتباري وجود ندارد. "
      },
      {
        "41",
        "کارت به علت مفقود شدن مسدود موقت است. "
      },
      {
        "43",
        "کارت به علت دزديده شدن دائماًمسدود است."
      },
      {
        "44",
        "اطلاعات قبض صحيح نيست يا قبض وجود ندارد. "
      },
      {
        "46",
        "بار کد صحيح نيست."
      },
      {
        "47",
        "قبض منقضي شده است."
      },
      {
        "48",
        "قبض قبلاً پرداخت شده است."
      },
      {
        "50",
        "لغو خريد پس از زمان مجاز صورت ميگردد."
      },
      {
        "51",
        "کمبود وجه(جهت انجام تراکنش مالي) "
      },
      {
        "53",
        "خطاي امنيتي "
      },
      {
        "55",
        "رمز نامعتبر "
      },
      {
        "56",
        "کارت نامعتبر(کارت تعريف نشده يا داده کارت غلط است) "
      },
      {
        "57",
        "تراکنش غير مجاز "
      },
      {
        "58",
        "ترمينال اجازه عمليات مورد نظر را ندارد."
      },
      {
        "59",
        "مشکوک به تقلب"
      },
      {
        "60",
        "در پاسخ به تراکنش ليست سياه يا پايان روز: ليست در مرکز حاضر نيست "
      },
      {
        "61",
        "مبلغ تراکنشهاي مربوط به بهاين کارت از حد مجاز گذشته است"
      },
      {
        "62",
        "مبلغ تراکنشهاي روز مربوط به بهاين کارت از حد مجاز گذشته است -63 MAC صحيح نمي باشد"
      },
      {
        "64",
        "در پاسخ به تراکنش پايان روز: تراکنش ارسال شده صحيح نيست."
      },
      {
        "65",
        "تعداد تراکنش هاي مربوط به اين کارت از حد مجاز گذشته است."
      },
      {
        "66",
        "حساب مسدود است "
      },
      {
        "67",
        "کارت ضبظ شود "
      },
      {
        "68",
        "مانده کارت صحيح نيست"
      },
      {
        "70",
        "در پاسخ به تراکنش پايان روز:تراز صحيح نيست و ليست سياه در مرکز حاضر نيست "
      },
      {
        "71",
        "در پاسخ به تراکنش پايان روز: تراکنش ارسال شده صحيح نيست وليست سياه حاضر نيست"
      },
      {
        "74",
        "بدليل يکي بودن شماره حساب مبدا و مقصد تراکنش انجام نمي گردد "
      },
      {
        "75",
        "تعدادرمز نامعتبر از حد مجاز گذشته است"
      },
      {
        "77",
        "روز مالي صحيح نيست(در تراکنش شتابي) "
      },
      {
        "78",
        "کارت فعال نيست "
      },
      {
        "79",
        "حساب تعريف نشده است "
      },
      {
        "80",
        "به دليل اشکال در حساب تراکنش پذيرفته نيست"
      },
      {
        "81",
        "کارت قبلاً باطل شده است"
      },
      {
        "82",
        "پاسخ ACK از ATM دريافت نشد "
      },
      {
        "83",
        "سيستم مرکزي آماده نيست"
      },
      {
        "84",
        "سيستم مرکزي فعال نيست"
      },
      {
        "85",
        "خطاي دروني سيستم مرکزي "
      },
      {
        "86",
        "تراکنش روي اين دستگاه مجاز نيست"
      },
      {
        "87",
        "خطاي دروني سيستم مرکزي "
      },
      {
        "88",
        "خطاي دروني سيستم مرکزي"
      },
      {
        "89",
        "خطاي دروني سيستم مرکزي "
      },
      {
        "90",
        "ارتباط در حين پردازش قطع شده است"
      },
      {
        "91",
        "عدم دريافت پاسخ به علت وقوع TIMEOUTدر مرکزو اعلام آن به دستگاه"
      },
      {
        "92",
        "صارد کننده نامعتبر است"
      },
      {
        "93",
        "به علت تراکنش ها صف تراکنشها در سيستم پر شده است "
      },
      {
        "94",
        "شماره تراکنش تکراري است "
      },
      {
        "96",
        "اشکال در سيستم مرکز"
      }
        };

        public string GetResponceCodeMessage(int ReasonCode)
        {
            string str = "";
            if (ReasonCode > 0)
            {
                for (int index = 0; index < this.ResponceMessage.Length; ++index)
                {
                    if (ReasonCode.ToString() == this.ResponceMessage[index, 0].ToString())
                    {
                        str = this.ResponceMessage[index, 1].ToString();
                        break;
                    }
                }
            }
            return str;
        }
    }
}
